## DataFrame.(add,sub,mul,div,truediv,floordiv,mod,pow)

* Among flexible wrappers to arithmetic operator

DataFrame.dic(other,axis='columns',level=None,fiil_value=None

### Parameters
* others:calar, sequence, Series, dict or DataFrame
  Any single or multiple element data structure, or list-like object.

* axis: {0 or ‘index’, 1 or ‘columns’}
  Whether to compare by the index (0 or ‘index’) or columns. (1 or ‘columns’). For Series input, axis to match Series index on.

* level: int or label
  Broadcast across a level, matching Index values on the passed MultiIndex level.

* fill_value:float or None, default None
  Fill existing missing (NaN) values, and any new element needed for successful DataFrame alignment, with this value before computation. If data in both corresponding DataFrame locations is missing the result will be missin

### Returns:
* DataFrame (Result of the arithmetic operation)

In [1]:
import pandas as pd

In [45]:
df=pd.DataFrame({'a':[1,2,3],
                'b':[4,5,6]}
                ,index=['one','two','three'])

df

       a  b
one    1  4
two    2  5
three  3  6

#### Adding a scalar

In [4]:
df+1 # The same result

       a  b
one    2  5
two    3  6
three  4  7

In [5]:
df.add(1)

       a  b
one    2  5
two    3  6
three  4  7

#### Dividing by constant with reverse version

In [6]:
df.div(2)

         a    b
one    0.5  2.0
two    1.0  2.5
three  1.5  3.0

In [7]:
df.rdiv(2)

              a         b
one    2.000000  0.500000
two    1.000000  0.400000
three  0.666667  0.333333

#### Subtracting a list and Series by axis with operator version

In [8]:
df

       a  b
one    1  4
two    2  5
three  3  6

In [9]:
df-[1,2]

       a  b
one    0  2
two    1  3
three  2  4

In [19]:
df.sub([1,2]) #comparing by columns.

       a  b
one    0  2
two    1  3
three  2  4

In [24]:
# Series input, matching Series index on.
df.sub(pd.Series([1,1,1],index=['one','two','three']),axis='index')

       a  b
one    0  3
two    1  4
three  2  5

#### Multiply a dictionary by axis

In [25]:
df

       a  b
one    1  4
two    2  5
three  3  6

In [26]:
df.multiply({'a':2,'b':3})

       a   b
one    2  12
two    4  15
three  6  18

In [27]:
df.multiply({'one':2,'two':2,'three':3},axis='index')

       a   b
one    2   8
two    4  10
three  9  18

#### Multiply a DataFrame of different shape with operator version

In [28]:
df2=pd.DataFrame({'a':[10,11,12]},index=['one','two','three'])
df2

        a
one    10
two    11
three  12

In [29]:
df

       a  b
one    1  4
two    2  5
three  3  6

In [30]:
df*df2

        a   b
one    10 NaN
two    22 NaN
three  36 NaN

In [31]:
df.mul(df,fill_value=0)

       a   b
one    1  16
two    4  25
three  9  36

#### Divide by a multiindex by level

In [62]:
df_mul=pd.DataFrame({'a':[1,2,3,4,5,6],
              'b':[2,5,3,10,11,12]},
             index=[['A','A','A','B','B','B'],['one','two','three',
                                              'four','five','six']])
df_mul

         a   b
A one    1   2
  two    2   5
  three  3   3
B four   4  10
  five   5  11
  six    6  12

In [63]:
df

       a  b
one    1  4
two    2  5
three  3  6

In [64]:
df.div(df_mul,level=1,fill_value=0)

           a    b
A one    1.0  2.0
  two    1.0  1.0
  three  1.0  2.0
B four   0.0  0.0
  five   0.0  0.0
  six    0.0  0.0